app/views/questions/show.html.erb


      <% @question.answers.each do |a| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 3]]