app/views/home/index.html.erb

    <div>
      <a href="<%= question_path(q) %>" class="btn btn-success btn-xs hidden-xs"><%= "View Answers (#{pluralize(q.answers.count,'answer')})" %></a>
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 7]]