app/controllers/answers_controller.rb

  def create
    question = Question.find(params[:answer][:question_id])
    answer = question.answers.create(answer_params)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 24]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "answers" ("email", "body", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "safdar211@gmail.com"], ["body", "My name is Mujahid ali."], ["question_id", 6], ["created_at", "2015-06-16 10:04:23.094083"], ["updated_at", "2015-06-16 10:04:23.094083"]]