app/controllers/home_controller.rb

  def index
    @questions = Question.order(:created_at=> :desc)
---
SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC