app/controllers/questions_controller.rb

  def create
    Question.create(question_params)
---
INSERT INTO "questions" ("email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "safdar211@hotmail.com"], ["body", "What is mathematics?"], ["created_at", "2015-06-15 09:57:24.360562"], ["updated_at", "2015-06-15 09:57:24.360562"]]